# ● Объектно-ориентированное программирование (сокр. ООП) — методология программирования,
# основанная на представлении программы в виде совокупности взаимодействующих объектов,
# каждый из которых является экземпляром определённого класса, а классы образуют иерархию наследования.

# ● Инкапсуляция — свойство системы, позволяющее объединить данные и методы, работающие с ними, в классе.

# ● Наследование — свойство системы, позволяющее описать новый класс на основе уже существующего с частично
# или полностью заимствованной функциональностью.
# Класс, от которого производится наследование, называется базовым, родительским или суперклассом.
# Новый класс — потомком, наследником, дочерним или производным классом.

# ● Полиморфизм — свойство системы, позволяющее использовать объекты с одинаковым интерфейсом
# без информации о типе и внутренней структуре объекта.

# ● Класс — универсальный, комплексный тип данных, состоящий из тематически единого набора «полей»
# (переменных более элементарных типов) и «методов» (функций для работы с этими полями),
# то есть он является моделью информационной сущности с внутренним и внешним интерфейсами для
# оперирования своим содержимым (значениями полей).


