# Под термином сериализация принято понимать преобразование объектов,
# а точнее хранящихся в них данных в набор байт для пересылки или хранения.

# При этом сериализованные данные можно подвергнуть десериализации,
# т.е. восстановлению данных из байтов в исходные объекты.

# Особенностью сериализации является превращение сложных многоуровневых объектов различной
# степени вложенности в линейный набор байтов.

# Такой поток легко передавать по каналам связи, хранить в файле и т.п.


# Определения:
# Сериализация данных
# Сериализация — это процесс преобразования объекта в поток байтов для сохранения или передачи в память,
# базу данных или файл.

# Десериализация данных
# Десериализация – восстановление объектов из байтов, сохранение которых было произведено ранее.

# Процедура выгрузки «зафиксированной» информации пользователем.
