
# CSV (от англ. Comma-Separated Values — значения, разделённые запятыми) —
# текстовый формат, предназначенный для представления табличных данных.

# Строка таблицы соответствует строке текста, которая содержит одно или
# несколько полей, разделенных запятыми.

# CSV часто используют там, где удобно хранить информацию в таблицах.
# Выгрузки из баз данных, из электронных таблиц для анализа данных.

# Пример данных в формате CSV:

# "Name","Sex","Age","Height (in)","Weight (lbs)"
# "Alex","M",41,74,170
# "Bert","M",42,68,166
# "Carl","M",32,70,155
# "Dave","M",39,72,167
